// З об&#39;єкту medicines потрібно отримати масив   в якому
// будуть лише назви препаратів.
// З масиву потрібно прибрати медикаменти , в яких строк
// зберігання уже пройшов . У новому масиві відсортувати
// медикаменти у хронологічному порядку.
//   Результат вивести у консоль.
// Застосувати стрілочні функції
// const medicines = {
//     Агалгін: new Date("2022-05-01"),
//     Ношпа: new Date("2025-07-02"),
//     Альфахолін: new Date("2024-12-21"),
//     Аспірин: new Date("2022-08-15"),
//     Аспаркам: new Date("2024-04-18"),
//    };

const medicines = {
  Аналгін: new Date("2022-05-01"),
  Ношпа: new Date("2025-07-02"),
  Альфахолін: new Date("2024-12-21"),
  Аспірин: new Date("2022-08-15"),
  Аспаркам: new Date("2024-04-18"),
};

const today = new Date();

const result = Object.entries(medicines)

  .filter(([name, date]) => date > today)

  .sort((a, b) => a[1] - b[1])

  .map(([name]) => name);

console.log(result);
